title = labarotor 8
authorisation = autorisation
login = login
password = mot de passe
host = h\u00F4te
port = port
notLoginYet = pas encore enregistr\u00E9
singUp = connexion
registration = enregistrement
filter = filtrer
groupCountingByPrice = regrouper par co\u00FBt
averageOfManufactureCost = co\u00FBt moyen de fabrication
key = cl\u00E9
id = identifiant unique
productName = nom du produit
coordinateX = coordonn\u00E9e X
coordinateY = coordonn\u00E9e Y
creationDate = date de cr\u00E9ation
price = co\u00FBt
manufactureCost = co\u00FBt de fabrication
unitOfMeasure = mesure de mesure
personName = nom du propri\u00E9taire
birthday = anniversaire
height = hauteur
locationX = emplacement X
locationY = emplacement Y
locationName = nom de l'emplacement
removeKey = supprimer par cl\u00E9
removeLowerKey = supprimer tout ce qui est inf\u00E9rieur \u00E0 la cl\u00E9
removeLower = supprimer tout ce qui est moins
removeAnyByUnitOfMeasure = supprimer quelque chose au fur et \u00E0 mesure
ok = OK
cancel = annuler
choose = choisissez
chooseDirectory = s\u00E9lectionner un r\u00E9pertoire
error = erreur
info = info
pcs = pi\u00E8ce
milliliters = millilitres
grams = grammes
addOwner = ajouter un propri\u00E9taire
canNOtBeNull = ne peut pas \u00EAtre vide
mustBeBigger = doit \u00EAtre plus grand
russian = russe
norwegian = norv\u00E9gien
french = fran\u00E7ais
spanish = espagnol
language = langue
back = en arri\u00E8re
format = format JJ-MM - AAAA HH: MM: SS
help = Update_ID (mettre \u00E0 Jour par un identifiant unique) mettre \u00E0 jour la valeur de l'\u00E9l\u00E9ment de collection dont l'id est \u00E9gal \u00E0 celui sp\u00E9cifi\u00E9 \n\
Execute_script (ex\u00E9cuter le script) lire et ex\u00E9cuter le script \u00E0 partir du fichier sp\u00E9cifi\u00E9. Le script contient les commandes de la m\u00EAme mani\u00E8re que l'utilisateur les saisit en mode interactif.\n\
Afficher affiche tous les \u00E9l\u00E9ments de la collection dans la repr\u00E9sentation sous forme de cha\u00EEne dans le flux de sortie standard \n\
Clear (effacer) effacer la collection \n\
Remove_any_by_unit_of_measure (supprimer quelque chose au co\u00FBt de fabrication) supprime de la collection un \u00E9l\u00E9ment dont la valeur de champ unitOfMeasure est \u00E9quivalente \u00E0 celle sp\u00E9cifi\u00E9e \n\
History (historique) affiche les 10 derni\u00E8res commandes (sans leurs arguments) \n\
Remove_Lower (supprimer moins) supprime de la collection tous les \u00E9l\u00E9ments plus petits que le sp\u00E9cifi\u00E9\n\
Aide affiche l'aide des commandes disponibles \n\
Exit (quitter) pour terminer le programme (sans enregistrer dans un fichier) \n\
Remove_Lower_Key supprime de la collection tous les \u00E9l\u00E9ments dont la cl\u00E9 est inf\u00E9rieure \u00E0 la cl\u00E9 sp\u00E9cifi\u00E9e \n\
Average_of_manufacture_cost affiche la valeur moyenne du champ manufactureCost pour tous les \u00E9l\u00E9ments de la collection \n\
Insert_Null (ajouter par ID unique) ajouter un nouvel \u00E9l\u00E9ment avec la cl\u00E9 sp\u00E9cifi\u00E9e \n\
Remove_Key (supprimer par cl\u00E9) supprimer un \u00E9l\u00E9ment de la collection par sa cl\u00E9 \n\
Group_counting_by_price (regrouper par prix) grouper les \u00E9l\u00E9ments de la collection par la valeur du champ price, afficher le nombre d'\u00E9l\u00E9ments dans chaque groupe \n\
Info affiche les informations de la collection (type, date d'initialisation, nombre d'\u00E9l\u00E9ments, etc.)dans le flux de sortie standard
mustBeIntegerNumberInt = le nombre doit \u00EAtre un entier de type int
mustBeIntegerNumberLong = le nombre doit \u00EAtre un entier long
mustBeFloatNumber = le nombre doit \u00EAtre de type float
wrongDate = format de date incorrect, r\u00E9p\u00E9tez la saisie au format JJ-MM-AAAA ou JJ-MM-AAAA HH:MM:SS
wrongUnitMeasure = format de mesure incorrect, choisissez parmi: grammes, millilitres, pi\u00E8ces
hostException = impossible de d\u00E9terminer l'h\u00F4te ou le port(doit \u00EAtre compris entre 1 et 6553)
InterException = Le serveur \u00E9tait probablement ferm\u00E9. Le client ne peut pas exister \u00E0 cause de:
ioException = Impossible de se connecter au serveur, v\u00E9rifiez l'adresse et le port de l'h\u00F4te:
thankYou = merci d'utiliser. Au revoir!
serverClosed = le serveur a \u00E9t\u00E9 ferm\u00E9
cycleInTheScript = boucle dans le script
